app/Helpers/my_helper.php

SELECT *
FROM `users`
WHERE `id` = '1'
---
function userLogin()
{
    $db = \Config\Database::connect();
    return $db->table('users')->where('id', session('id'))->get()->getRow();

SELECT *
FROM `models`
WHERE `type` = 'randomforest'
---
function models($nam)
{
    $db = \Config\Database::connect();
    return $db->table('models')->where('type', $nam)->get()->getLastRow();